const teamData = [
  {
    name: "محمد ريكاردو",
    position: "مصور",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray.png",
      orange: "/assets/images/team-member-orange.png",
      main: "/assets/images/team-member.png",
    },
  },
  {
    name: "هند مرمش",
    position: "منسق المشاريع",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray2.png",
      orange: "/assets/images/team-member-orange2.png",
    },
  },
  {
    name: "احلام عبد الجبار",
    position: "مدير العمليات",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray3.png",
      orange: "/assets/images/team-member-orange3.png",
      main: "/assets/images/team-member3.png",
    },
  },
  {
    name: "بشار صلح",
    position: "الشريك الإداري",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray4.png",
      orange: "/assets/images/team-member-orange4.png",
      main: "/assets/images/team-member4.png",
    },
  },
  {
    name: "جميل الأشقر",
    position: "سينيور جرافيك ديزاينر",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray5.png",
      orange: "/assets/images/team-member-orange5.png",
      main: "/assets/images/team-member5.png",
    },
  },
  {
    name: "محمد شطحوف",
    position: "سينيور جرافيك ديزاينر",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray6.png",
      orange: "/assets/images/team-member-orange6.png",
      main: "/assets/images/team-member6.png",
    },
  },
  {
    name: "نضال عديلات",
    position: "مساعد إنتاج",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray7.png",
      orange: "/assets/images/team-member-orange7.png",
      main: "/assets/images/team-member7.png",
    },
  },
  {
    name: "محمود عديلات",
    position: "مسؤول الإنتاج والتصوير",
    description:
      "بشار هو المؤسس المشارك والمدير في شركة ميديا ​​بلس، وهو مسؤول عن قيادة العمليات التجارية وتنفيذ استراتيجياتالتسويق. بخبرة تزيد عن عشر سنوات في التسويق والعلاقات العامة، يتمتع بشار بخلفية شاملة في تطوير حملات تسويقيةفعّالة تُلبي أهداف الأعمال والاتصالات. بشار شغوف بدمج الرسائل الاستراتيجية مع أحدث تقنيات بناء العلاماتالتجارية، لبناء علامات عملائنا التجارية والحفاظ عليها وتنميتها عبر جميع وسائل الإعلام. يتميز بمهارات تواصل فعّالة،ومهارات شخصية عالية، وقدرة على حل المشكلات، وتحليلية.",
    images: {
      gray: "/assets/images/team-member-gray8.png",
      orange: "/assets/images/team-member-orange8.png",
      main: "/assets/images/team-member8.png",
    },
  },
];

const teamSection = document.getElementById("team");

teamData.forEach((member) => {
  const memberDiv = document.createElement("div");
  memberDiv.className = "team-members";

  memberDiv.innerHTML = `
    <div class="gray-wrapper">
      <img src="${member.images.gray}" alt="gray" class="team-member-gray" />
      <div class="gray-description">
        <h3>سيرة ذاتية</h3>
        <p>${member.description || "لا توجد سيرة ذاتية متاحة."}</p>
      </div>
    </div>

    <img src="${
      member.images.orange
    }" alt="orange" class="team-member-orange" />
    ${
      member.images.main
        ? `<img src="${member.images.main}" alt="main" class="team-member" />`
        : ""
    }

    <div class="member-bottom">
      <p class="team-member-name">${member.name}</p>
      <p class="team-member-postion">${member.position}</p>
    </div>
  `;

  teamSection.appendChild(memberDiv);
});
