const data = {
  paragraph: `أعلنت وزارة الصحة عن انطلاق حملة تطعيم شاملة ضد فيروس الإنفلونزا في جميع
  محافظات الوطن، تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة
  عن انطلاق حملة تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن،
  تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة
  تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات
  العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة تطعيم شاملة ضد
  فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات العمرية فوق 6
  محافظات الوطن، تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة
  عن انطلاق حملة تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن،
  تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة
  تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات
  العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة تطعيم شاملة ضد
  فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات العمرية فوق 6
  محافظات الوطن، تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة
  عن انطلاق حملة تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن،
  تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة
  تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات
  العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة تطعيم شاملة ضد
  فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات العمرية فوق 6
  محافظات الوطن، تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة
  عن انطلاق حملة تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن،
  تستهدف الفئات العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة
  تطعيم شاملة ضد فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات
  العمرية فوق 6 أشهر، وذلك أعلنت وزارة الصحة عن انطلاق حملة تطعيم شاملة ضد
  فيروس الإنفلونزا في جميع محافظات الوطن، تستهدف الفئات العمرية فوق 6
  أشهر، وذلك`,
  images: [
    "/assets/images/inner-services.png",
    "/assets/images/inner-services2.png",
    "/assets/images/inner-services3.png",
  ],
};

const section = document.getElementById("inner-cards-section");

let imagesHTML = "";
data.images.forEach((src) => {
  imagesHTML += `<img src="${src}" alt="image" />`;
});

section.innerHTML = `
  <p class="publicPara inner-cards-para">
    ${data.paragraph}
  </p>
  <div id="images-container-services">
    ${imagesHTML}
  </div>
`;
